# Brief pandas reference

In [1]:
import numpy as np
import pandas as pd

## Series

In [2]:
ser = pd.Series([1,2,3,4,5])
ser

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Index

A series has index and array representations.

In [3]:
ser.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
ser.array

<NumpyExtensionArray>
[1, 2, 3, 4, 5]
Length: 5, dtype: int64

Index can be assinged. Usage is the same for custom index.

In [5]:
ser2 = pd.Series([1,2,3,4], index=['a','b','c','d'])
ser2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
ser2['a']

1

In [7]:
ser2['a'] = 0
ser2

a    0
b    2
c    3
d    4
dtype: int64

In [8]:
np.log1p(ser2)

a    0.000000
b    1.098612
c    1.386294
d    1.609438
dtype: float64

Index can be reassigned as well.

In [9]:
ser2.index = ['z', 'y', 'x', 'w']
ser2

z    0
y    2
x    3
w    4
dtype: int64

### Dictionary

Series is almost like a dictionary. Index serve as keys.

In [10]:
0 in ser

True

In [11]:
'd' in ser2

False

In [12]:
4 in ser2

False

In [13]:
breakfasts = {'eggs': 1.49, 'bacons': 1.99, 'pancakes': .99}
ser3 = pd.Series(breakfasts)
ser3

eggs        1.49
bacons      1.99
pancakes    0.99
dtype: float64

In [14]:
ser3.to_dict()

{'eggs': 1.49, 'bacons': 1.99, 'pancakes': 0.99}

Changing the order of the series is easy.

In [15]:
favorites = ['bacons', 'eggs', 'potatoes']
ser4 = pd.Series(breakfasts, index=favorites)
ser4

bacons      1.99
eggs        1.49
potatoes     NaN
dtype: float64

### Checking NA

In [16]:
ser4.isna()

bacons      False
eggs        False
potatoes     True
dtype: bool

In [17]:
ser4.notna()

bacons       True
eggs         True
potatoes    False
dtype: bool

### Operations

Arithmetic operations are performed on each index.

In [18]:
ser3 + ser4

bacons      3.98
eggs        2.98
pancakes     NaN
potatoes     NaN
dtype: float64

### Name

Series and its index can have names.

In [19]:
ser3.name = 'breakfasts'
ser3.index.name = 'menu'
ser3

menu
eggs        1.49
bacons      1.99
pancakes    0.99
Name: breakfasts, dtype: float64

## DataFrame

Dictionary is basically a bunch of series on columns.

In [20]:
data = {'customer': ['Puppy', 'Piggy', 'Kitty', 'Puppy', 'Kitty', 'Piggy'],
        'order': ['Lunch', 'Dinner', 'Dinner', 'Breakfast', 'Breakfast', 'Lunch'],
        'total': [1.49, 2.49, 2.99, .99, .99, 2.99]}
df = pd.DataFrame(data)
df

  customer      order  total
0    Puppy      Lunch   1.49
1    Piggy     Dinner   2.49
2    Kitty     Dinner   2.99
3    Puppy  Breakfast   0.99
4    Kitty  Breakfast   0.99
5    Piggy      Lunch   2.99

In [21]:
df.head()

  customer      order  total
0    Puppy      Lunch   1.49
1    Piggy     Dinner   2.49
2    Kitty     Dinner   2.99
3    Puppy  Breakfast   0.99
4    Kitty  Breakfast   0.99

In [22]:
pd.DataFrame(data, columns=['total', 'customer'])

   total customer
0   1.49    Puppy
1   2.49    Piggy
2   2.99    Kitty
3   0.99    Puppy
4   0.99    Kitty
5   2.99    Piggy

In [23]:
tips = pd.Series([.5, .2], index=[1, 4])
df['tips'] = tips
df

  customer      order  total  tips
0    Puppy      Lunch   1.49   NaN
1    Piggy     Dinner   2.49   0.5
2    Kitty     Dinner   2.99   NaN
3    Puppy  Breakfast   0.99   NaN
4    Kitty  Breakfast   0.99   0.2
5    Piggy      Lunch   2.99   NaN

In [24]:
del df['tips']
df

  customer      order  total
0    Puppy      Lunch   1.49
1    Piggy     Dinner   2.49
2    Kitty     Dinner   2.99
3    Puppy  Breakfast   0.99
4    Kitty  Breakfast   0.99
5    Piggy      Lunch   2.99

### Dictionary within dictionary

Outer keys are columns and inner keys are rows. Since dictionary only allows one unique keys, only the last duplicate keys are used. However, index can have duplicate values.

In [25]:
data2 = {'customer': {'Lunch': 'Puppy', 'Dinner': 'Piggy', 'Dinner': 'Kitty', 'Breakfast': 'Puppy'},
        'total': {'Lunch': 1.49, 'Dinner': 2.49, 'Dinner': 2.99, 'Breakfast': .99}}
df2 = pd.DataFrame(data2)
df2

          customer  total
Lunch        Puppy   1.49
Dinner       Kitty   2.99
Breakfast    Puppy   0.99

In [26]:
df2.T

          Lunch Dinner Breakfast
customer  Puppy  Kitty     Puppy
total      1.49   2.99      0.99

Transposing can lose information about columns' data type if they have different types.

### Specifying index

In [27]:
pd.DataFrame(df2, index=['Lunch', 'Dinner', 'Snacks'])

       customer  total
Lunch     Puppy   1.49
Dinner    Kitty   2.99
Snacks      NaN    NaN

Series can be passed for each column.

In [31]:
df2['customer']

meals
Lunch        Puppy
Dinner       Kitty
Breakfast    Puppy
Name: customer, dtype: object

In [28]:
pd.DataFrame({'customer': df2['customer']})

          customer
Lunch        Puppy
Dinner       Kitty
Breakfast    Puppy

In [29]:
df2.index.name = 'meals'
df2.columns.name = 'customer_info'
df2

customer_info customer  total
meals
Lunch            Puppy   1.49
Dinner           Kitty   2.99
Breakfast        Puppy   0.99

Only data is converted to numpy array with a dtype.

In [30]:
df2.to_numpy()

array([['Puppy', 1.49],
       ['Kitty', 2.99],
       ['Puppy', 0.99]], dtype=object)

In [32]:
df2.T.to_numpy()

array([['Puppy', 'Kitty', 'Puppy'],
       [1.49, 2.99, 0.99]], dtype=object)

## Index

In [33]:
index = pd.Index(np.arange(100, 103))
index

Index([100, 101, 102], dtype='int64')

In [34]:
index2 = pd.Series([1,2,3], index=[11,12,13]).index
index2

Index([11, 12, 13], dtype='int64')

Index is immutable. Therefore, it is safe to pass around index objects to other series or dataframes.

In [35]:
# index2[1] = 3

In [36]:
ser5 = pd.Series(['a', 'b', 'c'], index=index)
ser5

100    a
101    b
102    c
dtype: object

In [37]:
ser5.index is index

True

As mentioned above, index can have duplicate values.

In [38]:
index2 = pd.Index(['a', 'a', 'b', 'c', 'b'])
index2

Index(['a', 'a', 'b', 'c', 'b'], dtype='object')

Interestingly, index use set methods.

In [39]:
index.append(pd.Index([200, 201, 202]))

Index([100, 101, 102, 200, 201, 202], dtype='int64')

In [40]:
index.intersection(pd.Index([101, 204, 211]))

Index([101], dtype='int64')

### Reindex

Reindex does not actually modifies the original object.

In [41]:
ser5

100    a
101    b
102    c
dtype: object

In [42]:
ser5.reindex([103, 102, 101, 100])

103    NaN
102      c
101      b
100      a
dtype: object

In [43]:
ser5

100    a
101    b
102    c
dtype: object

Missing values can be filled with a method, such as bfill (backfill), ffill (forward-fill), and nearest.

In [44]:
ser5.reindex(np.arange(98, 105), method='nearest')

98     a
99     a
100    a
101    b
102    c
103    c
104    c
dtype: object

Same thing applies to DataFrames.

In [45]:
df

  customer      order  total
0    Puppy      Lunch   1.49
1    Piggy     Dinner   2.49
2    Kitty     Dinner   2.99
3    Puppy  Breakfast   0.99
4    Kitty  Breakfast   0.99
5    Piggy      Lunch   2.99

In [46]:
df.reindex(np.arange(8))

  customer      order  total
0    Puppy      Lunch   1.49
1    Piggy     Dinner   2.49
2    Kitty     Dinner   2.99
3    Puppy  Breakfast   0.99
4    Kitty  Breakfast   0.99
5    Piggy      Lunch   2.99
6      NaN        NaN    NaN
7      NaN        NaN    NaN

In [47]:
df.reindex(columns=list(df.columns) + ['rating'])

  customer      order  total  rating
0    Puppy      Lunch   1.49     NaN
1    Piggy     Dinner   2.49     NaN
2    Kitty     Dinner   2.99     NaN
3    Puppy  Breakfast   0.99     NaN
4    Kitty  Breakfast   0.99     NaN
5    Piggy      Lunch   2.99     NaN

### `loc` and `iloc`

`loc` only works if index and columns exist. (no NaN)

Also, it is preferred over indexing because of specificity. `loc` is for index names and `iloc` is for integers.

In [48]:
df.loc[[1, 3, 5], ['customer', 'total']]

  customer  total
1    Piggy   2.49
3    Puppy   0.99
5    Piggy   2.99

In [49]:
df.iloc[[2,4], [0,1]]

  customer      order
2    Kitty     Dinner
4    Kitty  Breakfast

`loc` is inclusive.

In [50]:
df.loc[1:3] = 5
df

  customer      order  total
0    Puppy      Lunch   1.49
1        5          5   5.00
2        5          5   5.00
3        5          5   5.00
4    Kitty  Breakfast   0.99
5    Piggy      Lunch   2.99

Boolean DataFrame is convenient.

In [51]:
df = pd.DataFrame(data)
df

  customer      order  total
0    Puppy      Lunch   1.49
1    Piggy     Dinner   2.49
2    Kitty     Dinner   2.99
3    Puppy  Breakfast   0.99
4    Kitty  Breakfast   0.99
5    Piggy      Lunch   2.99

In [52]:
df[df['total'] > 1]

  customer   order  total
0    Puppy   Lunch   1.49
1    Piggy  Dinner   2.49
2    Kitty  Dinner   2.99
5    Piggy   Lunch   2.99

This works, but avoid chained indexing when assigning.

In [53]:
df[df['total'] > 1][df.customer == 'Piggy']

/tmp/ipykernel_4431/2755174201.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df['total'] > 1][df.customer == 'Piggy']

  customer   order  total
1    Piggy  Dinner   2.49
5    Piggy   Lunch   2.99

Boolean arrays only works on `loc`, but not `iloc`.

In [54]:
df.loc[df.total > 1]

  customer   order  total
0    Puppy   Lunch   1.49
1    Piggy  Dinner   2.49
2    Kitty  Dinner   2.99
5    Piggy   Lunch   2.99

In [55]:
df.iloc[1:3, 1:]

    order  total
1  Dinner   2.49
2  Dinner   2.99

When selecting rows, it's like selecting a series.

## More functionalities

### Drop

In [56]:
ser3

menu
eggs        1.49
bacons      1.99
pancakes    0.99
Name: breakfasts, dtype: float64

In [57]:
ser3.drop('eggs')

menu
bacons      1.99
pancakes    0.99
Name: breakfasts, dtype: float64

In [58]:
df.drop(index=[1, 2], columns=['total'])

  customer      order
0    Puppy      Lunch
3    Puppy  Breakfast
4    Kitty  Breakfast
5    Piggy      Lunch

### Arithmetic

When arithmetic is performed on series and dataframe, series broadcasted over the rows.

In [59]:
df3 = pd.DataFrame(np.arange(10, 19).reshape((3,3)), columns=['a', 'b', 'c'])
df3

    a   b   c
0  10  11  12
1  13  14  15
2  16  17  18

In [60]:
ser6 = pd.Series([3, 2], index=['a', 'b'])
ser6

a    3
b    2
dtype: int64

In [61]:
df3 - ser6

      a     b   c
0   7.0   9.0 NaN
1  10.0  12.0 NaN
2  13.0  15.0 NaN

Or over the columns with some more code.

In [64]:
df3.add(df3['c'], axis=0)

    a   b   c
0  22  23  24
1  28  29  30
2  34  35  36

### apply & map

`apply` calls a function across rows. Or columns.

In [65]:
def add_min(series): return series.min() + series

In [66]:
df3.apply(add_min)

    a   b   c
0  20  22  24
1  23  25  27
2  26  28  30

`map` applies element-wise functions.

In [67]:
df3.map(lambda x: f'{x} friends')

            a           b           c
0  10 friends  11 friends  12 friends
1  13 friends  14 friends  15 friends
2  16 friends  17 friends  18 friends

### Sorting

`sort_index` and `sort_values`.

In [68]:
df4 = pd.DataFrame(np.random.randint(0, 100, size=(3, 4)), index=[1,0,2], columns=[4,3,2,1])
df4

    4   3   2   1
1  52  63  54  22
0   4  23  74   9
2  82   7  34  35

In [69]:
df4.sort_index()

    4   3   2   1
0   4  23  74   9
1  52  63  54  22
2  82   7  34  35

In [74]:
df4.sort_index(axis=1)

    1   2   3   4
1  22  54  63  52
0   9  74  23   4
2  35  34   7  82

sorting values over column.

In [79]:
df4.sort_values(4)

    4   3   2   1
0   4  23  74   9
1  52  63  54  22
2  82   7  34  35